# 什么叫变量
"""
    变量就是一个存储数据的时候当前数据所在的内存地址的名字
        num1 = 10

    目的：为了快速找到数据

"""
# 定义变量
"""
    
    变量名 = 值 （赋值，程序是先计算等号右边的数值，然后把值赋值给变量里）
    
    有命名规则
        ：数字，字母，下划线组成
        ：不能数字开头
        ：不能使用内置关键字 共计33个关键字
        
    严格区分大小写
        ：A != a

"""

# 命名习惯
"""

    见名知意
    大驼峰：MyName（首个英文字母大写）
    小驼峰：myName（第二个含以后的单词首字母大写）
    下划线： my_name

"""
# 使用变量
"""
    1.定义变量  语法：变量名 = 值
    2.使用变量
    3.看变量的特点

"""
# 定义变量 存储数据汤姆
MyName = 'TOM'
print(MyName)

# 定义变量 存储黑马程序员
school_name = '黑马程序员'
print(school_name)
